# Homebrew bundle — system deps mise can't handle, plus macOS apps.
# Run: brew bundle --file=install/mac/Brewfile
#
# Everything else (CLI tools, runtimes) lives in common/.config/mise/config.toml.

tap "protonpass/tap"

# Shell & git (system deps mise doesn't cover)
brew "bash"                      # modern v5; macOS ships ancient v3
brew "git"                       # prefer over Xcode CLT git
brew "zsh-autosuggestions"       # source-only plugin; no mise backend
brew "zsh-syntax-highlighting"   # source-only plugin; no mise backend

# Tools not in mise registry (or better from brew)
brew "entr"                      # not in mise registry
brew "ffmpeg"                    # mise backend compiles from source (slow)

# Custom formula / taps
brew "agent-browser"
brew "protonpass/tap/pass-cli"

# Casks — desktop apps
cask "proton-pass"
cask "claude"
cask "reader"
cask "docker-desktop"
cask "ghostty"
cask "helium-browser"
cask "homerow"
cask "karabiner-elements"
cask "mattermost"
cask "obsidian"
cask "raycast"
cask "shottr"
cask "signal"
cask "superwhisper"
cask "whatsapp"
cask "yoink"
cask "zed@preview"
