{
  "plugins": {
    "Navigator.nvim": {
      "src": "git@github.com:numToStr/Navigator.nvim.git"
    },
    "arborist.nvim": {
      "src": "git@github.com:arborist-ts/arborist.nvim"
    },
    "black-atom": {
      "src": "git@github.com:black-atom-industries/nvim.git"
    },
    "conform.nvim": {
      "src": "git@github.com:stevearc/conform.nvim"
    },
    "iter.nvim": {
      "src": "git@github.com:black-atom-industries/iter.nvim.git"
    },
    "mini.nvim": {
      "src": "https://github.com/nvim-mini/mini.nvim"
    },
    "nvim-spider": {
      "src": "git@github.com:chrisgrieser/nvim-spider"
    },
    "nvim-ts-autotag": {
      "src": "git@github.com:windwp/nvim-ts-autotag"
    },
    "supermaven-nvim": {
      "src": "git@github.com:supermaven-inc/supermaven-nvim"
    },
    "treewalker.nvim": {
      "src": "git@github.com:aaronik/treewalker.nvim"
    },
    "ts-comments.nvim": {
      "src": "git@github.com:folke/ts-comments.nvim"
    },
    "vim-sleuth": {
      "src": "git@github.com:tpope/vim-sleuth"
    }
  }
}
