{
  "plugins": {
    "Navigator.nvim": {
      "src": "git@github.com:numToStr/Navigator.nvim.git"
    },
    "SchemaStore.nvim": {
      "src": "git@github.com:b0o/SchemaStore.nvim"
    },
    "annotator.nvim": {
      "src": "git@github.com:chpeters/annotator.nvim"
    },
    "arborist.nvim": {
      "src": "git@github.com:arborist-ts/arborist.nvim"
    },
    "black-atom": {
      "src": "git@github.com:black-atom-industries/nvim.git"
    },
    "blink.cmp": {
      "src": "git@github.com:saghen/blink.cmp",
      "version": "1.0.0 - 2.0.0"
    },
    "codediff.nvim": {
      "src": "git@github.com:esmuellert/codediff.nvim"
    },
    "conform.nvim": {
      "src": "git@github.com:stevearc/conform.nvim"
    },
    "friendly-snippets": {
      "src": "git@github.com:rafamadriz/friendly-snippets"
    },
    "gitlinker.nvim": {
      "src": "git@github.com:linrongbin16/gitlinker.nvim"
    },
    "grug-far.nvim": {
      "src": "git@github.com:MagicDuck/grug-far.nvim"
    },
    "helpview.nvim": {
      "src": "git@github.com:OXY2DEV/helpview.nvim"
    },
    "kulala.nvim": {
      "src": "git@github.com:mistweaverco/kulala.nvim"
    },
    "lazydev.nvim": {
      "src": "git@github.com:folke/lazydev.nvim"
    },
    "mdn.nvim": {
      "src": "git@github.com:nikbrunner/mdn.nvim"
    },
    "mini.nvim": {
      "src": "https://github.com/nvim-mini/mini.nvim"
    },
    "nui.nvim": {
      "src": "git@github.com:MunifTanjim/nui.nvim"
    },
    "nvim-lint": {
      "src": "git@github.com:mfussenegger/nvim-lint"
    },
    "nvim-spider": {
      "src": "git@github.com:chrisgrieser/nvim-spider"
    },
    "nvim-ts-autotag": {
      "src": "git@github.com:windwp/nvim-ts-autotag"
    },
    "oklch-color-picker.nvim": {
      "src": "git@github.com:eero-lehtinen/oklch-color-picker.nvim"
    },
    "pack-ui.nvim": {
      "src": "https://github.com/jtprogru/pack-ui.nvim"
    },
    "qmk.nvim": {
      "src": "git@github.com:codethread/qmk.nvim"
    },
    "quicker.nvim": {
      "src": "git@github.com:stevearc/quicker.nvim"
    },
    "radar.nvim": {
      "src": "git@github.com:black-atom-industries/radar.nvim"
    },
    "snacks.nvim": {
      "src": "git@github.com:folke/snacks.nvim"
    },
    "supermaven-nvim": {
      "src": "git@github.com:supermaven-inc/supermaven-nvim"
    },
    "treewalker.nvim": {
      "src": "git@github.com:aaronik/treewalker.nvim"
    },
    "trouble.nvim": {
      "src": "git@github.com:folke/trouble.nvim"
    },
    "ts-comments.nvim": {
      "src": "git@github.com:folke/ts-comments.nvim"
    },
    "ts-error-translator.nvim": {
      "src": "git@github.com:dmmulroy/ts-error-translator.nvim"
    },
    "tsc.nvim": {
      "src": "git@github.com:dmmulroy/tsc.nvim"
    },
    "vim-sleuth": {
      "src": "git@github.com:tpope/vim-sleuth"
    },
    "whatthejump.nvim": {
      "src": "git@github.com:lewis6991/whatthejump.nvim"
    }
  }
}
