tap "1password/tap"
tap "charmbracelet/tap"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "wez/wezterm"
brew "ansible"
brew "bat"
brew "busted"
brew "cask"
brew "cmake"
brew "cmatrix"
brew "deno"
brew "difftastic"
brew "dpkg"
brew "eza"
brew "fakeroot"
brew "fd"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "grep"
brew "gum"
brew "htop"
brew "imagemagick"
brew "jq"
brew "pandoc"
brew "jupyterlab"
brew "lazydocker"
brew "lazygit"
brew "libserialport"
brew "lua-language-server"
brew "luacheck"
brew "luarocks"
brew "neovim"
brew "nvm"
brew "ripgrep"
brew "stylua"
brew "tmux"
brew "tree"
brew "vifm"
brew "wget"
brew "woff2"
brew "yazi"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "qmk/qmk/qmk"
cask "1password"
cask "brave-browser"
cask "bruno"
cask "chatgpt"
cask "figma"
cask "firefox"
cask "font-comic-shanns-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple"
cask "font-recursive-mono-nerd-font"
cask "font-sf-mono-nerd-font"
cask "google-chrome"
cask "handbrake"
cask "insomnia"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keycastr"
cask "linear-linear"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "mos"
cask "obsidian"
cask "raycast"
cask "signal"
cask "slack"
cask "spotify"
cask "telegram-desktop"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "warp"
cask "wezterm"
cask "whatsapp"
cask "zed"
cask "zen-browser"
