# Arch Linux package list — system deps mise can't handle.
# One package per line (pacman / AUR). Comments and blank lines ignored.
#
# Install: paru -S --needed --noconfirm $(grep -v '^\s*#\|^\s*$' install/arch/pkglist.txt)
#
# Everything else (CLI tools, runtimes) lives in common/.config/mise/config.toml.

# System core
git
zsh
paru

# System deps (no mise backend, or mise compiles from source)
ffmpeg
mpd
mpc
entr
lua51
luarocks

# Shell plugins (source-only, no mise backend)
zsh-autosuggestions
zsh-syntax-highlighting

# ProtonPass + SSH
pass-cli
proton-pass

# Desktop apps
claude-desktop-native
signal-desktop
mattermost-desktop
zapzap
zed-preview-bin
obsidian
helium-browser-bin
docker

# Wayland/Niri desktop
awww
waypaper
chafa
niri
waybar
fuzzel
satty
clipse
wtype

# Bluetooth
bluez
bluez-utils
bluetui

# Gaming
gamemode
lib32-gamemode